SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_slcd.h
/***********************************************************************************************************************
    @file     reg_slcd.h
    @author   VV TEAM
    @brief    This flie contains all the SLCD's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_SLCD_H
#define __REG_SLCD_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include <core_cm0plus.h>



/**
  * @brief SLCD Base Address Definition
  */
#define  SLCD_BASE                                 0x40009400                                       /*!<Base Address: 0x40009400*/

/**
  * @brief SLCD Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                             /*!<SLCD Control register                          offset: 0x00       */
    __IO uint32_t FCR;                            /*!<SLCD Frame control register                    offset: 0x04       */
    __IO uint32_t SR;                             /*!<SLCD Status register                           offset: 0x08       */
    __IO uint32_t CLRR;                           /*!<SLCD Status clear register                     offset: 0x0C       */
    __IO uint32_t BLKR0;                          /*!<SLCD Blinking control register 0               offset: 0x10       */
    __IO uint32_t BLKR1;                          /*!<SLCD Blinking control register 1               offset: 0x14       */
    __IO uint32_t BLKR2;                          /*!<SLCD Blinking control register 2               offset: 0x18       */
    __IO uint32_t BLKR3;                          /*!<SLCD Blinking control register 3               offset: 0x1C       */
    __IO uint32_t IOENR0;                         /*!<SLCD IO enable register 0                      offset: 0x20       */
    __IO uint32_t IOENR1;                         /*!<SLCD IO enable register 1                      offset: 0x24       */
    __IO uint32_t RESERVED0x28[2];                /*!<                                               offset: 0x28~0x2C  */
    __IO uint32_t CFGR0;                          /*!<SLCD COM/SEG configuration register 0          offset: 0x30       */
    __IO uint32_t CFGR1;                          /*!<SLCD COM/SEG configuration register 1          offset: 0x34       */
    __IO uint32_t IDXR0;                          /*!<SLCD COM index register 0                      offset: 0x38       */
    __IO uint32_t IDXR1;                          /*!<SLCD COM index register 1                      offset: 0x3C       */
    __IO uint32_t DR[16];                         /*!<SLCD Display data register                    offset: 0x40       */
} SLCD_TypeDef;

/**
  * @brief SLCD type pointer Definition
  */
#define SLCD                                      ((SLCD_TypeDef *)SLCD_BASE)

/**
  * @brief SLCD_CR Register Bit Definition
  */
#define  SLCD_CR_SLCDEN_Pos                       (0)
#define  SLCD_CR_SLCDEN_Msk                       (0x1U << SLCD_CR_SLCDEN_Pos)                      /*!<SLCD module enable*/
#define  SLCD_CR_SLCDEN                           SLCD_CR_SLCDEN_Msk
#define  SLCD_CR_LPEN_Pos                         (1)
#define  SLCD_CR_LPEN_Msk                         (0x1U << SLCD_CR_LPEN_Pos)                        /*!<Low power drive waveform enable*/
#define  SLCD_CR_LPEN                             SLCD_CR_LPEN_Msk
#define  SLCD_CR_DUTY_Pos                         (2)
#define  SLCD_CR_DUTY_Msk                         (0x7U << SLCD_CR_DUTY_Pos)                        /*!<Duty cycle mode selection*/
#define  SLCD_CR_DUTY                             SLCD_CR_DUTY_Msk
#define  SLCD_CR_DUTY_0                           (0x1U << SLCD_CR_DUTY_Pos) 
#define  SLCD_CR_DUTY_1                           (0x2U << SLCD_CR_DUTY_Pos) 
#define  SLCD_CR_DUTY_2                           (0x4U << SLCD_CR_DUTY_Pos) 
#define  SLCD_CR_BIAS_Pos                         (5)
#define  SLCD_CR_BIAS_Msk                         (0x3U << SLCD_CR_BIAS_Pos)                        /*!<Bias mode selection*/
#define  SLCD_CR_BIAS                             SLCD_CR_BIAS_Msk
#define  SLCD_CR_BIAS_0                           (0x1U << SLCD_CR_BIAS_Pos) 
#define  SLCD_CR_BIAS_1                           (0x2U << SLCD_CR_BIAS_Pos) 
#define  SLCD_CR_CPMODE_Pos                       (7)
#define  SLCD_CR_CPMODE_Msk                       (0x3U << SLCD_CR_CPMODE_Pos)                      /*!<Charge pump mode selection*/
#define  SLCD_CR_CPMODE                           SLCD_CR_CPMODE_Msk
#define  SLCD_CR_CPMODE_0                         (0x1U << SLCD_CR_CPMODE_Pos) 
#define  SLCD_CR_CPMODE_1                         (0x2U << SLCD_CR_CPMODE_Pos) 
#define  SLCD_CR_REFEN_Pos                        (9)
#define  SLCD_CR_REFEN_Msk                        (0x1U << SLCD_CR_REFEN_Pos)                       /*!<Internal voltage reference enable*/
#define  SLCD_CR_REFEN                            SLCD_CR_REFEN_Msk
#define  SLCD_CR_VDDEN_Pos                        (10)
#define  SLCD_CR_VDDEN_Msk                        (0x1U << SLCD_CR_VDDEN_Pos)                       /*!<Internal VDD as SLCD power enable*/
#define  SLCD_CR_VDDEN                            SLCD_CR_VDDEN_Msk
#define  SLCD_CR_INTR_Pos                         (11)
#define  SLCD_CR_INTR_Msk                         (0x1U << SLCD_CR_INTR_Pos)                        /*!<Internal resistor divider mode is enabled*/
#define  SLCD_CR_INTR                             SLCD_CR_INTR_Msk
#define  SLCD_CR_INTLP_Pos                        (12)
#define  SLCD_CR_INTLP_Msk                        (0x1U << SLCD_CR_INTLP_Pos)                       /*!<Internal resistor divider power consumption mode*/
#define  SLCD_CR_INTLP                            SLCD_CR_INTLP_Msk

/**
  * @brief SLCD_FCR Register Bit Definition
  */
#define  SLCD_FCR_SLCDIE_Pos                      (0)
#define  SLCD_FCR_SLCDIE_Msk                      (0x1U << SLCD_FCR_SLCDIE_Pos)                     /*!<LCD module interrupt enable*/
#define  SLCD_FCR_SLCDIE                          SLCD_FCR_SLCDIE_Msk
#define  SLCD_FCR_EOFIE_Pos                       (1)
#define  SLCD_FCR_EOFIE_Msk                       (0x1U << SLCD_FCR_EOFIE_Pos)                      /*!<End of frame interrupt enable*/
#define  SLCD_FCR_EOFIE                           SLCD_FCR_EOFIE_Msk
#define  SLCD_FCR_BLKIE_Pos                       (2)
#define  SLCD_FCR_BLKIE_Msk                       (0x1U << SLCD_FCR_BLKIE_Pos)                      /*!<Blinking interrupt enable*/
#define  SLCD_FCR_BLKIE                           SLCD_FCR_BLKIE_Msk
#define  SLCD_FCR_SOFF_Pos                        (3)
#define  SLCD_FCR_SOFF_Msk                        (0x1U << SLCD_FCR_SOFF_Pos)                       /*!<Close all SEGs*/
#define  SLCD_FCR_SOFF                            SLCD_FCR_SOFF_Msk
#define  SLCD_FCR_CC_Pos                          (4)
#define  SLCD_FCR_CC_Msk                          (0xFU << SLCD_FCR_CC_Pos)                         /*!<Contrast control*/
#define  SLCD_FCR_CC                              SLCD_FCR_CC_Msk
#define  SLCD_FCR_CC_0                            (0x1U << SLCD_FCR_CC_Pos) 
#define  SLCD_FCR_CC_1                            (0x2U << SLCD_FCR_CC_Pos) 
#define  SLCD_FCR_CC_2                            (0x4U << SLCD_FCR_CC_Pos) 
#define  SLCD_FCR_CC_3                            (0x8U << SLCD_FCR_CC_Pos) 
#define  SLCD_FCR_DEAD_Pos                        (8)
#define  SLCD_FCR_DEAD_Msk                        (0x7U << SLCD_FCR_DEAD_Pos)                       /*!<Dead insertion*/
#define  SLCD_FCR_DEAD                            SLCD_FCR_DEAD_Msk
#define  SLCD_FCR_DEAD_0                          (0x1U << SLCD_FCR_DEAD_Pos) 
#define  SLCD_FCR_DEAD_1                          (0x2U << SLCD_FCR_DEAD_Pos) 
#define  SLCD_FCR_DEAD_2                          (0x4U << SLCD_FCR_DEAD_Pos) 
#define  SLCD_FCR_BLINK_Pos                       (11)
#define  SLCD_FCR_BLINK_Msk                       (0x3U << SLCD_FCR_BLINK_Pos)                      /*!<Blinking mode selection*/
#define  SLCD_FCR_BLINK                           SLCD_FCR_BLINK_Msk
#define  SLCD_FCR_BLINK_0                         (0x1U << SLCD_FCR_BLINK_Pos) 
#define  SLCD_FCR_BLINK_1                         (0x2U << SLCD_FCR_BLINK_Pos) 
#define  SLCD_FCR_BLINKF_Pos                      (13)
#define  SLCD_FCR_BLINKF_Msk                      (0x7U << SLCD_FCR_BLINKF_Pos)                     /*!<Blinking division*/
#define  SLCD_FCR_BLINKF                          SLCD_FCR_BLINKF_Msk
#define  SLCD_FCR_BLINKF_0                        (0x1U << SLCD_FCR_BLINKF_Pos) 
#define  SLCD_FCR_BLINKF_1                        (0x2U << SLCD_FCR_BLINKF_Pos) 
#define  SLCD_FCR_BLINKF_2                        (0x4U << SLCD_FCR_BLINKF_Pos) 
#define  SLCD_FCR_DIV_Pos                         (16)
#define  SLCD_FCR_DIV_Msk                         (0xFU << SLCD_FCR_DIV_Pos)                        /*!<SLCD clock division*/
#define  SLCD_FCR_DIV                             SLCD_FCR_DIV_Msk
#define  SLCD_FCR_DIV_0                           (0x1U << SLCD_FCR_DIV_Pos) 
#define  SLCD_FCR_DIV_1                           (0x2U << SLCD_FCR_DIV_Pos) 
#define  SLCD_FCR_DIV_2                           (0x4U << SLCD_FCR_DIV_Pos) 
#define  SLCD_FCR_DIV_3                           (0x8U << SLCD_FCR_DIV_Pos) 
#define  SLCD_FCR_PS_Pos                          (20)
#define  SLCD_FCR_PS_Msk                          (0xFU << SLCD_FCR_PS_Pos)                         /*!<SLCD clock prescaler*/
#define  SLCD_FCR_PS                              SLCD_FCR_PS_Msk
#define  SLCD_FCR_PS_0                            (0x1U << SLCD_FCR_PS_Pos) 
#define  SLCD_FCR_PS_1                            (0x2U << SLCD_FCR_PS_Pos) 
#define  SLCD_FCR_PS_2                            (0x4U << SLCD_FCR_PS_Pos) 
#define  SLCD_FCR_PS_3                            (0x8U << SLCD_FCR_PS_Pos) 
#define  SLCD_FCR_CPDIV_Pos                       (24)
#define  SLCD_FCR_CPDIV_Msk                       (0x7U << SLCD_FCR_CPDIV_Pos)                      /*!<Charge pump clock division*/
#define  SLCD_FCR_CPDIV                           SLCD_FCR_CPDIV_Msk
#define  SLCD_FCR_CPDIV_0                         (0x1U << SLCD_FCR_CPDIV_Pos) 
#define  SLCD_FCR_CPDIV_1                         (0x2U << SLCD_FCR_CPDIV_Pos) 
#define  SLCD_FCR_CPDIV_2                         (0x4U << SLCD_FCR_CPDIV_Pos) 
#define  SLCD_FCR_DRLC_Pos                        (27)
#define  SLCD_FCR_DRLC_Msk                        (0x1U << SLCD_FCR_DRLC_Pos)                       /*!<SLCD_DR [7:0] data clear*/
#define  SLCD_FCR_DRLC                            SLCD_FCR_DRLC_Msk
#define  SLCD_FCR_DRHC_Pos                        (28)
#define  SLCD_FCR_DRHC_Msk                        (0x1U << SLCD_FCR_DRHC_Pos)                       /*!<SLCD_DR [15:8] data clear*/
#define  SLCD_FCR_DRHC                            SLCD_FCR_DRHC_Msk
#define  SLCD_FCR_DRSEL_Pos                       (29)
#define  SLCD_FCR_DRSEL_Msk                       (0x1U << SLCD_FCR_DRSEL_Pos)                      /*!<Display register selection*/
#define  SLCD_FCR_DRSEL                           SLCD_FCR_DRSEL_Msk
#define  SLCD_FCR_DMAEN_Pos                       (30)
#define  SLCD_FCR_DMAEN_Msk                       (0x1U << SLCD_FCR_DMAEN_Pos)                      /*!<DMA transfer enable*/
#define  SLCD_FCR_DMAEN                           SLCD_FCR_DMAEN_Msk

/**
  * @brief SLCD_SR Register Bit Definition
  */
#define  SLCD_SR_ENS_Pos                          (0)
#define  SLCD_SR_ENS_Msk                          (0x1U << SLCD_SR_ENS_Pos)                         /*!<SLCD enable flag*/
#define  SLCD_SR_ENS                              SLCD_SR_ENS_Msk
#define  SLCD_SR_EOF_Pos                          (1)
#define  SLCD_SR_EOF_Msk                          (0x1U << SLCD_SR_EOF_Pos)                         /*!<End of frame flag*/
#define  SLCD_SR_EOF                              SLCD_SR_EOF_Msk
#define  SLCD_SR_BLKF_Pos                         (2)
#define  SLCD_SR_BLKF_Msk                         (0x1U << SLCD_SR_BLKF_Pos)                        /*!<Blinking cycle flag*/
#define  SLCD_SR_BLKF                             SLCD_SR_BLKF_Msk
#define  SLCD_SR_DRSS_Pos                         (3)
#define  SLCD_SR_DRSS_Msk                         (0x1U << SLCD_SR_DRSS_Pos)                        /*!<Display data register indication*/
#define  SLCD_SR_DRSS                             SLCD_SR_DRSS_Msk
#define  SLCD_SR_FCRSF_Pos                        (5)
#define  SLCD_SR_FCRSF_Msk                        (0x1U << SLCD_SR_FCRSF_Pos)                       /*!<FCR register synchronization flag*/
#define  SLCD_SR_FCRSF                            SLCD_SR_FCRSF_Msk

/**
  * @brief SLCD_CLRR Register Bit Definition
  */
#define  SLCD_CLRR_EOFC_Pos                       (1)
#define  SLCD_CLRR_EOFC_Msk                       (0x1U << SLCD_CLRR_EOFC_Pos)                      /*!<Clear the end of frame flag*/
#define  SLCD_CLRR_EOFC                           SLCD_CLRR_EOFC_Msk
#define  SLCD_CLRR_BLKFC_Pos                      (2)
#define  SLCD_CLRR_BLKFC_Msk                      (0x1U << SLCD_CLRR_BLKFC_Pos)                     /*!<Clear the blinking cycle flag*/
#define  SLCD_CLRR_BLKFC                          SLCD_CLRR_BLKFC_Msk

/**
  * @brief SLCD_BLKR0 Register Bit Definition
  */
#define  SLCD_BLKR0_SEGIDX0_Pos                   (0)
#define  SLCD_BLKR0_SEGIDX0_Msk                   (0x3FU << SLCD_BLKR0_SEGIDX0_Pos)                 /*!<Blinking SEG0 index*/
#define  SLCD_BLKR0_SEGIDX0                       SLCD_BLKR0_SEGIDX0_Msk
#define  SLCD_BLKR0_SEGIDX0_0                     (0x01U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_SEGIDX0_1                     (0x02U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_SEGIDX0_2                     (0x04U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_SEGIDX0_3                     (0x08U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_SEGIDX0_4                     (0x10U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_SEGIDX0_5                     (0x20U << SLCD_BLKR0_SEGIDX0_Pos) 
#define  SLCD_BLKR0_COMIDX0_Pos                   (8)
#define  SLCD_BLKR0_COMIDX0_Msk                   (0x7U << SLCD_BLKR0_COMIDX0_Pos)                  /*!<Blinking COM0 index*/
#define  SLCD_BLKR0_COMIDX0                       SLCD_BLKR0_COMIDX0_Msk
#define  SLCD_BLKR0_COMIDX0_0                     (0x1U << SLCD_BLKR0_COMIDX0_Pos) 
#define  SLCD_BLKR0_COMIDX0_1                     (0x2U << SLCD_BLKR0_COMIDX0_Pos) 
#define  SLCD_BLKR0_COMIDX0_2                     (0x4U << SLCD_BLKR0_COMIDX0_Pos) 
#define  SLCD_BLKR0_IDXEN0_Pos                    (15)
#define  SLCD_BLKR0_IDXEN0_Msk                    (0x1U << SLCD_BLKR0_IDXEN0_Pos)                   /*!<Blinking index 0 enable*/
#define  SLCD_BLKR0_IDXEN0                        SLCD_BLKR0_IDXEN0_Msk
#define  SLCD_BLKR0_SEGIDX1_Pos                   (16)
#define  SLCD_BLKR0_SEGIDX1_Msk                   (0x3FU << SLCD_BLKR0_SEGIDX1_Pos)                 /*!<Blinking SEG1 index*/
#define  SLCD_BLKR0_SEGIDX1                       SLCD_BLKR0_SEGIDX1_Msk
#define  SLCD_BLKR0_SEGIDX1_0                     (0x01U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_SEGIDX1_1                     (0x02U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_SEGIDX1_2                     (0x04U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_SEGIDX1_3                     (0x08U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_SEGIDX1_4                     (0x10U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_SEGIDX1_5                     (0x20U << SLCD_BLKR0_SEGIDX1_Pos) 
#define  SLCD_BLKR0_COMIDX1_Pos                   (24)
#define  SLCD_BLKR0_COMIDX1_Msk                   (0x7U << SLCD_BLKR0_COMIDX1_Pos)                  /*!<Blinking COM1 index*/
#define  SLCD_BLKR0_COMIDX1                       SLCD_BLKR0_COMIDX1_Msk
#define  SLCD_BLKR0_COMIDX1_0                     (0x1U << SLCD_BLKR0_COMIDX1_Pos) 
#define  SLCD_BLKR0_COMIDX1_1                     (0x2U << SLCD_BLKR0_COMIDX1_Pos) 
#define  SLCD_BLKR0_COMIDX1_2                     (0x4U << SLCD_BLKR0_COMIDX1_Pos) 
#define  SLCD_BLKR0_IDXEN1_Pos                    (31)
#define  SLCD_BLKR0_IDXEN1_Msk                    (0x1U << SLCD_BLKR0_IDXEN1_Pos)                   /*!<Blinking index 1 enable*/
#define  SLCD_BLKR0_IDXEN1                        SLCD_BLKR0_IDXEN1_Msk

/**
  * @brief SLCD_BLKR1 Register Bit Definition
  */
#define  SLCD_BLKR1_SEGIDX2_Pos                   (0)
#define  SLCD_BLKR1_SEGIDX2_Msk                   (0x3FU << SLCD_BLKR1_SEGIDX2_Pos)                 /*!<Blinking SEG2 index*/
#define  SLCD_BLKR1_SEGIDX2                       SLCD_BLKR1_SEGIDX2_Msk
#define  SLCD_BLKR1_SEGIDX2_0                     (0x01U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_SEGIDX2_1                     (0x02U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_SEGIDX2_2                     (0x04U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_SEGIDX2_3                     (0x08U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_SEGIDX2_4                     (0x10U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_SEGIDX2_5                     (0x20U << SLCD_BLKR1_SEGIDX2_Pos) 
#define  SLCD_BLKR1_COMIDX2_Pos                   (8)
#define  SLCD_BLKR1_COMIDX2_Msk                   (0x7U << SLCD_BLKR1_COMIDX2_Pos)                  /*!<Blinking COM2 index*/
#define  SLCD_BLKR1_COMIDX2                       SLCD_BLKR1_COMIDX2_Msk
#define  SLCD_BLKR1_COMIDX2_0                     (0x1U << SLCD_BLKR1_COMIDX2_Pos) 
#define  SLCD_BLKR1_COMIDX2_1                     (0x2U << SLCD_BLKR1_COMIDX2_Pos) 
#define  SLCD_BLKR1_COMIDX2_2                     (0x4U << SLCD_BLKR1_COMIDX2_Pos) 
#define  SLCD_BLKR1_IDXEN2_Pos                    (15)
#define  SLCD_BLKR1_IDXEN2_Msk                    (0x1U << SLCD_BLKR1_IDXEN2_Pos)                   /*!<Blinking index 2 enable*/
#define  SLCD_BLKR1_IDXEN2                        SLCD_BLKR1_IDXEN2_Msk
#define  SLCD_BLKR1_SEGIDX3_Pos                   (16)
#define  SLCD_BLKR1_SEGIDX3_Msk                   (0x3FU << SLCD_BLKR1_SEGIDX3_Pos)                 /*!<Blinking SEG3 index*/
#define  SLCD_BLKR1_SEGIDX3                       SLCD_BLKR1_SEGIDX3_Msk
#define  SLCD_BLKR1_SEGIDX3_0                     (0x01U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_SEGIDX3_1                     (0x02U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_SEGIDX3_2                     (0x04U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_SEGIDX3_3                     (0x08U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_SEGIDX3_4                     (0x10U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_SEGIDX3_5                     (0x20U << SLCD_BLKR1_SEGIDX3_Pos) 
#define  SLCD_BLKR1_COMIDX3_Pos                   (24)
#define  SLCD_BLKR1_COMIDX3_Msk                   (0x7U << SLCD_BLKR1_COMIDX3_Pos)                  /*!<Blinking COM3 index*/
#define  SLCD_BLKR1_COMIDX3                       SLCD_BLKR1_COMIDX3_Msk
#define  SLCD_BLKR1_COMIDX3_0                     (0x1U << SLCD_BLKR1_COMIDX3_Pos) 
#define  SLCD_BLKR1_COMIDX3_1                     (0x2U << SLCD_BLKR1_COMIDX3_Pos) 
#define  SLCD_BLKR1_COMIDX3_2                     (0x4U << SLCD_BLKR1_COMIDX3_Pos) 
#define  SLCD_BLKR1_IDXEN3_Pos                    (31)
#define  SLCD_BLKR1_IDXEN3_Msk                    (0x1U << SLCD_BLKR1_IDXEN3_Pos)                   /*!<Blinking index 3 enable*/
#define  SLCD_BLKR1_IDXEN3                        SLCD_BLKR1_IDXEN3_Msk

