SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_slcd.h
/**
  * @brief SLCD_BLKR2 Register Bit Definition
  */
#define  SLCD_BLKR2_SEGIDX4_Pos                   (0)
#define  SLCD_BLKR2_SEGIDX4_Msk                   (0x3FU << SLCD_BLKR2_SEGIDX4_Pos)                 /*!<Blinking SEG4 index*/
#define  SLCD_BLKR2_SEGIDX4                       SLCD_BLKR2_SEGIDX4_Msk
#define  SLCD_BLKR2_SEGIDX4_0                     (0x01U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_SEGIDX4_1                     (0x02U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_SEGIDX4_2                     (0x04U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_SEGIDX4_3                     (0x08U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_SEGIDX4_4                     (0x10U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_SEGIDX4_5                     (0x20U << SLCD_BLKR2_SEGIDX4_Pos) 
#define  SLCD_BLKR2_COMIDX4_Pos                   (8)
#define  SLCD_BLKR2_COMIDX4_Msk                   (0x7U << SLCD_BLKR2_COMIDX4_Pos)                  /*!<Blinking COM4 index*/
#define  SLCD_BLKR2_COMIDX4                       SLCD_BLKR2_COMIDX4_Msk
#define  SLCD_BLKR2_COMIDX4_0                     (0x1U << SLCD_BLKR2_COMIDX4_Pos) 
#define  SLCD_BLKR2_COMIDX4_1                     (0x2U << SLCD_BLKR2_COMIDX4_Pos) 
#define  SLCD_BLKR2_COMIDX4_2                     (0x4U << SLCD_BLKR2_COMIDX4_Pos) 
#define  SLCD_BLKR2_IDXEN4_Pos                    (15)
#define  SLCD_BLKR2_IDXEN4_Msk                    (0x1U << SLCD_BLKR2_IDXEN4_Pos)                   /*!<Blinking index 4 enable*/
#define  SLCD_BLKR2_IDXEN4                        SLCD_BLKR2_IDXEN4_Msk
#define  SLCD_BLKR2_SEGIDX5_Pos                   (16)
#define  SLCD_BLKR2_SEGIDX5_Msk                   (0x3FU << SLCD_BLKR2_SEGIDX5_Pos)                 /*!<Blinking SEG5 index*/
#define  SLCD_BLKR2_SEGIDX5                       SLCD_BLKR2_SEGIDX5_Msk
#define  SLCD_BLKR2_SEGIDX5_0                     (0x01U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_SEGIDX5_1                     (0x02U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_SEGIDX5_2                     (0x04U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_SEGIDX5_3                     (0x08U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_SEGIDX5_4                     (0x10U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_SEGIDX5_5                     (0x20U << SLCD_BLKR2_SEGIDX5_Pos) 
#define  SLCD_BLKR2_COMIDX5_Pos                   (24)
#define  SLCD_BLKR2_COMIDX5_Msk                   (0x7U << SLCD_BLKR2_COMIDX5_Pos)                  /*!<Blinking COM5 index*/
#define  SLCD_BLKR2_COMIDX5                       SLCD_BLKR2_COMIDX5_Msk
#define  SLCD_BLKR2_COMIDX5_0                     (0x1U << SLCD_BLKR2_COMIDX5_Pos) 
#define  SLCD_BLKR2_COMIDX5_1                     (0x2U << SLCD_BLKR2_COMIDX5_Pos) 
#define  SLCD_BLKR2_COMIDX5_2                     (0x4U << SLCD_BLKR2_COMIDX5_Pos) 
#define  SLCD_BLKR2_IDXEN5_Pos                    (31)
#define  SLCD_BLKR2_IDXEN5_Msk                    (0x1U << SLCD_BLKR2_IDXEN5_Pos)                   /*!<Blinking index 5 enable*/
#define  SLCD_BLKR2_IDXEN5                        SLCD_BLKR2_IDXEN5_Msk

/**
  * @brief SLCD_BLKR3 Register Bit Definition
  */
#define  SLCD_BLKR3_SEGIDX6_Pos                   (0)
#define  SLCD_BLKR3_SEGIDX6_Msk                   (0x3FU << SLCD_BLKR3_SEGIDX6_Pos)                 /*!<Blinking SEG6 index*/
#define  SLCD_BLKR3_SEGIDX6                       SLCD_BLKR3_SEGIDX6_Msk
#define  SLCD_BLKR3_SEGIDX6_0                     (0x01U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_SEGIDX6_1                     (0x02U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_SEGIDX6_2                     (0x04U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_SEGIDX6_3                     (0x08U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_SEGIDX6_4                     (0x10U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_SEGIDX6_5                     (0x20U << SLCD_BLKR3_SEGIDX6_Pos) 
#define  SLCD_BLKR3_COMIDX6_Pos                   (8)
#define  SLCD_BLKR3_COMIDX6_Msk                   (0x7U << SLCD_BLKR3_COMIDX6_Pos)                  /*!<Blinking COM6 index*/
#define  SLCD_BLKR3_COMIDX6                       SLCD_BLKR3_COMIDX6_Msk
#define  SLCD_BLKR3_COMIDX6_0                     (0x1U << SLCD_BLKR3_COMIDX6_Pos) 
#define  SLCD_BLKR3_COMIDX6_1                     (0x2U << SLCD_BLKR3_COMIDX6_Pos) 
#define  SLCD_BLKR3_COMIDX6_2                     (0x4U << SLCD_BLKR3_COMIDX6_Pos) 
#define  SLCD_BLKR3_IDXEN6_Pos                    (15)
#define  SLCD_BLKR3_IDXEN6_Msk                    (0x1U << SLCD_BLKR3_IDXEN6_Pos)                   /*!<Blinking index 6 enable*/
#define  SLCD_BLKR3_IDXEN6                        SLCD_BLKR3_IDXEN6_Msk
#define  SLCD_BLKR3_SEGIDX7_Pos                   (16)
#define  SLCD_BLKR3_SEGIDX7_Msk                   (0x3FU << SLCD_BLKR3_SEGIDX7_Pos)                 /*!<Blinking SEG7 index*/
#define  SLCD_BLKR3_SEGIDX7                       SLCD_BLKR3_SEGIDX7_Msk
#define  SLCD_BLKR3_SEGIDX7_0                     (0x01U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_SEGIDX7_1                     (0x02U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_SEGIDX7_2                     (0x04U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_SEGIDX7_3                     (0x08U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_SEGIDX7_4                     (0x10U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_SEGIDX7_5                     (0x20U << SLCD_BLKR3_SEGIDX7_Pos) 
#define  SLCD_BLKR3_COMIDX7_Pos                   (24)
#define  SLCD_BLKR3_COMIDX7_Msk                   (0x7U << SLCD_BLKR3_COMIDX7_Pos)                  /*!<Blinking COM7 index*/
#define  SLCD_BLKR3_COMIDX7                       SLCD_BLKR3_COMIDX7_Msk
#define  SLCD_BLKR3_COMIDX7_0                     (0x1U << SLCD_BLKR3_COMIDX7_Pos) 
#define  SLCD_BLKR3_COMIDX7_1                     (0x2U << SLCD_BLKR3_COMIDX7_Pos) 
#define  SLCD_BLKR3_COMIDX7_2                     (0x4U << SLCD_BLKR3_COMIDX7_Pos) 
#define  SLCD_BLKR3_IDXEN7_Pos                    (31)
#define  SLCD_BLKR3_IDXEN7_Msk                    (0x1U << SLCD_BLKR3_IDXEN7_Pos)                   /*!<Blinking index 7 enable*/
#define  SLCD_BLKR3_IDXEN7                        SLCD_BLKR3_IDXEN7_Msk

/**
  * @brief SLCD_IOENR0 Register Bit Definition
  */
#define  SLCD_IOENR0_IOENR0_Pos                   (0)
#define  SLCD_IOENR0_IOENR0_Msk                   (0xFFFFFFFFU << SLCD_IOENR0_IOENR0_Pos)           /*!<IO enable control corresponding to the low 32 bit SLCD pin.*/
#define  SLCD_IOENR0_IOENR0                       SLCD_IOENR0_IOENR0_Msk
#define  SLCD_IOENR0_IOENR0_0                     (0x00000001U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_1                     (0x00000002U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_2                     (0x00000004U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_3                     (0x00000008U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_4                     (0x00000010U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_5                     (0x00000020U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_6                     (0x00000040U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_7                     (0x00000080U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_8                     (0x00000100U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_9                     (0x00000200U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_10                    (0x00000400U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_11                    (0x00000800U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_12                    (0x00001000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_13                    (0x00002000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_14                    (0x00004000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_15                    (0x00008000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_16                    (0x00010000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_17                    (0x00020000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_18                    (0x00040000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_19                    (0x00080000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_20                    (0x00100000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_21                    (0x00200000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_22                    (0x00400000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_23                    (0x00800000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_24                    (0x01000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_25                    (0x02000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_26                    (0x04000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_27                    (0x08000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_28                    (0x10000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_29                    (0x20000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_30                    (0x40000000U << SLCD_IOENR0_IOENR0_Pos) 
#define  SLCD_IOENR0_IOENR0_31                    (0x80000000U << SLCD_IOENR0_IOENR0_Pos) 

/**
  * @brief SLCD_IOENR1 Register Bit Definition
  */
#define  SLCD_IOENR1_IOENR1_Pos                   (0)
#define  SLCD_IOENR1_IOENR1_Msk                   (0xFFFFFFFFU << SLCD_IOENR1_IOENR1_Pos)           /*!<IO enable control corresponding to the high 32 bit SLCD pin.*/
#define  SLCD_IOENR1_IOENR1                       SLCD_IOENR1_IOENR1_Msk
#define  SLCD_IOENR1_IOENR1_0                     (0x00000001U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_1                     (0x00000002U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_2                     (0x00000004U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_3                     (0x00000008U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_4                     (0x00000010U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_5                     (0x00000020U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_6                     (0x00000040U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_7                     (0x00000080U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_8                     (0x00000100U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_9                     (0x00000200U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_10                    (0x00000400U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_11                    (0x00000800U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_12                    (0x00001000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_13                    (0x00002000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_14                    (0x00004000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_15                    (0x00008000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_16                    (0x00010000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_17                    (0x00020000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_18                    (0x00040000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_19                    (0x00080000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_20                    (0x00100000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_21                    (0x00200000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_22                    (0x00400000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_23                    (0x00800000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_24                    (0x01000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_25                    (0x02000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_26                    (0x04000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_27                    (0x08000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_28                    (0x10000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_29                    (0x20000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_30                    (0x40000000U << SLCD_IOENR1_IOENR1_Pos) 
#define  SLCD_IOENR1_IOENR1_31                    (0x80000000U << SLCD_IOENR1_IOENR1_Pos) 

/**
  * @brief SLCD_CFGR0 Register Bit Definition
  */
#define  SLCD_CFGR0_CFG0_Pos                      (0)
#define  SLCD_CFGR0_CFG0_Msk                      (0xFFFFFFFFU << SLCD_CFGR0_CFG0_Pos)              /*!<SEG/COM selection control corresponding to the low 32 bit SLCD*/
#define  SLCD_CFGR0_CFG0                          SLCD_CFGR0_CFG0_Msk
#define  SLCD_CFGR0_CFG0_0                        (0x00000001U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_1                        (0x00000002U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_2                        (0x00000004U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_3                        (0x00000008U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_4                        (0x00000010U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_5                        (0x00000020U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_6                        (0x00000040U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_7                        (0x00000080U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_8                        (0x00000100U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_9                        (0x00000200U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_10                       (0x00000400U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_11                       (0x00000800U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_12                       (0x00001000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_13                       (0x00002000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_14                       (0x00004000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_15                       (0x00008000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_16                       (0x00010000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_17                       (0x00020000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_18                       (0x00040000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_19                       (0x00080000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_20                       (0x00100000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_21                       (0x00200000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_22                       (0x00400000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_23                       (0x00800000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_24                       (0x01000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_25                       (0x02000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_26                       (0x04000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_27                       (0x08000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_28                       (0x10000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_29                       (0x20000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_30                       (0x40000000U << SLCD_CFGR0_CFG0_Pos) 
#define  SLCD_CFGR0_CFG0_31                       (0x80000000U << SLCD_CFGR0_CFG0_Pos) 

/**
  * @brief SLCD_CFGR1 Register Bit Definition
  */
#define  SLCD_CFGR1_CFG1_Pos                      (0)
#define  SLCD_CFGR1_CFG1_Msk                      (0xFFFFFFFFU << SLCD_CFGR1_CFG1_Pos)              /*!<SEG/COM selection control corresponding to the high 32 bit SLCD*/
#define  SLCD_CFGR1_CFG1                          SLCD_CFGR1_CFG1_Msk
#define  SLCD_CFGR1_CFG1_0                        (0x00000001U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_1                        (0x00000002U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_2                        (0x00000004U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_3                        (0x00000008U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_4                        (0x00000010U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_5                        (0x00000020U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_6                        (0x00000040U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_7                        (0x00000080U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_8                        (0x00000100U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_9                        (0x00000200U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_10                       (0x00000400U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_11                       (0x00000800U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_12                       (0x00001000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_13                       (0x00002000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_14                       (0x00004000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_15                       (0x00008000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_16                       (0x00010000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_17                       (0x00020000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_18                       (0x00040000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_19                       (0x00080000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_20                       (0x00100000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_21                       (0x00200000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_22                       (0x00400000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_23                       (0x00800000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_24                       (0x01000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_25                       (0x02000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_26                       (0x04000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_27                       (0x08000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_28                       (0x10000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_29                       (0x20000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_30                       (0x40000000U << SLCD_CFGR1_CFG1_Pos) 
#define  SLCD_CFGR1_CFG1_31                       (0x80000000U << SLCD_CFGR1_CFG1_Pos) 

/**
  * @brief SLCD_IDXR0 Register Bit Definition
  */
#define  SLCD_IDXR0_COM0IDX_Pos                   (0)
#define  SLCD_IDXR0_COM0IDX_Msk                   (0x3FU << SLCD_IDXR0_COM0IDX_Pos)                 /*!<COM0 index*/
#define  SLCD_IDXR0_COM0IDX                       SLCD_IDXR0_COM0IDX_Msk
#define  SLCD_IDXR0_COM0IDX_0                     (0x01U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM0IDX_1                     (0x02U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM0IDX_2                     (0x04U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM0IDX_3                     (0x08U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM0IDX_4                     (0x10U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM0IDX_5                     (0x20U << SLCD_IDXR0_COM0IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_Pos                   (8)
#define  SLCD_IDXR0_COM1IDX_Msk                   (0x3FU << SLCD_IDXR0_COM1IDX_Pos)                 /*!<COM1 index*/
#define  SLCD_IDXR0_COM1IDX                       SLCD_IDXR0_COM1IDX_Msk
#define  SLCD_IDXR0_COM1IDX_0                     (0x01U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_1                     (0x02U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_2                     (0x04U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_3                     (0x08U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_4                     (0x10U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM1IDX_5                     (0x20U << SLCD_IDXR0_COM1IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_Pos                   (16)
#define  SLCD_IDXR0_COM2IDX_Msk                   (0x3FU << SLCD_IDXR0_COM2IDX_Pos)                 /*!<COM2 index*/
#define  SLCD_IDXR0_COM2IDX                       SLCD_IDXR0_COM2IDX_Msk
#define  SLCD_IDXR0_COM2IDX_0                     (0x01U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_1                     (0x02U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_2                     (0x04U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_3                     (0x08U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_4                     (0x10U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM2IDX_5                     (0x20U << SLCD_IDXR0_COM2IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_Pos                   (24)
#define  SLCD_IDXR0_COM3IDX_Msk                   (0x3FU << SLCD_IDXR0_COM3IDX_Pos)                 /*!<COM3 index*/
#define  SLCD_IDXR0_COM3IDX                       SLCD_IDXR0_COM3IDX_Msk
#define  SLCD_IDXR0_COM3IDX_0                     (0x01U << SLCD_IDXR0_COM3IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_1                     (0x02U << SLCD_IDXR0_COM3IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_2                     (0x04U << SLCD_IDXR0_COM3IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_3                     (0x08U << SLCD_IDXR0_COM3IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_4                     (0x10U << SLCD_IDXR0_COM3IDX_Pos) 
#define  SLCD_IDXR0_COM3IDX_5                     (0x20U << SLCD_IDXR0_COM3IDX_Pos) 

