SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_slcd.h
/**
  * @brief SLCD_IDXR1 Register Bit Definition
  */
#define  SLCD_IDXR1_COM4IDX_Pos                   (0)
#define  SLCD_IDXR1_COM4IDX_Msk                   (0x3FU << SLCD_IDXR1_COM4IDX_Pos)                 /*!<COM4 index*/
#define  SLCD_IDXR1_COM4IDX                       SLCD_IDXR1_COM4IDX_Msk
#define  SLCD_IDXR1_COM4IDX_0                     (0x01U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM4IDX_1                     (0x02U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM4IDX_2                     (0x04U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM4IDX_3                     (0x08U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM4IDX_4                     (0x10U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM4IDX_5                     (0x20U << SLCD_IDXR1_COM4IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_Pos                   (8)
#define  SLCD_IDXR1_COM5IDX_Msk                   (0x3FU << SLCD_IDXR1_COM5IDX_Pos)                 /*!<COM5 index*/
#define  SLCD_IDXR1_COM5IDX                       SLCD_IDXR1_COM5IDX_Msk
#define  SLCD_IDXR1_COM5IDX_0                     (0x01U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_1                     (0x02U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_2                     (0x04U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_3                     (0x08U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_4                     (0x10U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM5IDX_5                     (0x20U << SLCD_IDXR1_COM5IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_Pos                   (16)
#define  SLCD_IDXR1_COM6IDX_Msk                   (0x3FU << SLCD_IDXR1_COM6IDX_Pos)                 /*!<COM6 index*/
#define  SLCD_IDXR1_COM6IDX                       SLCD_IDXR1_COM6IDX_Msk
#define  SLCD_IDXR1_COM6IDX_0                     (0x01U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_1                     (0x02U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_2                     (0x04U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_3                     (0x08U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_4                     (0x10U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM6IDX_5                     (0x20U << SLCD_IDXR1_COM6IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_Pos                   (24)
#define  SLCD_IDXR1_COM7IDX_Msk                   (0x3FU << SLCD_IDXR1_COM7IDX_Pos)                 /*!<COM7 index*/
#define  SLCD_IDXR1_COM7IDX                       SLCD_IDXR1_COM7IDX_Msk
#define  SLCD_IDXR1_COM7IDX_0                     (0x01U << SLCD_IDXR1_COM7IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_1                     (0x02U << SLCD_IDXR1_COM7IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_2                     (0x04U << SLCD_IDXR1_COM7IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_3                     (0x08U << SLCD_IDXR1_COM7IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_4                     (0x10U << SLCD_IDXR1_COM7IDX_Pos) 
#define  SLCD_IDXR1_COM7IDX_5                     (0x20U << SLCD_IDXR1_COM7IDX_Pos) 

/**
  * @brief SLCD_DR0 Register Bit Definition
  */
#define  SLCD_DR0_SLCD_DR0_Pos                    (0)
#define  SLCD_DR0_SLCD_DR0_Msk                    (0xFFFFFFFFU << SLCD_DR0_SLCD_DR0_Pos)            /*!<Low 32 bit display data corresponding to COM0*/
#define  SLCD_DR0_SLCD_DR0                        SLCD_DR0_SLCD_DR0_Msk
#define  SLCD_DR0_SLCD_DR0_0                      (0x00000001U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_1                      (0x00000002U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_2                      (0x00000004U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_3                      (0x00000008U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_4                      (0x00000010U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_5                      (0x00000020U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_6                      (0x00000040U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_7                      (0x00000080U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_8                      (0x00000100U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_9                      (0x00000200U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_10                     (0x00000400U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_11                     (0x00000800U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_12                     (0x00001000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_13                     (0x00002000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_14                     (0x00004000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_15                     (0x00008000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_16                     (0x00010000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_17                     (0x00020000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_18                     (0x00040000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_19                     (0x00080000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_20                     (0x00100000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_21                     (0x00200000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_22                     (0x00400000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_23                     (0x00800000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_24                     (0x01000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_25                     (0x02000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_26                     (0x04000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_27                     (0x08000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_28                     (0x10000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_29                     (0x20000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_30                     (0x40000000U << SLCD_DR0_SLCD_DR0_Pos) 
#define  SLCD_DR0_SLCD_DR0_31                     (0x80000000U << SLCD_DR0_SLCD_DR0_Pos) 

/**
  * @brief SLCD_DR1 Register Bit Definition
  */
#define  SLCD_DR1_SLCD_DR1_Pos                    (0)
#define  SLCD_DR1_SLCD_DR1_Msk                    (0xFFFFFFFFU << SLCD_DR1_SLCD_DR1_Pos)            /*!<High 32 bit display data corresponding to COM0*/
#define  SLCD_DR1_SLCD_DR1                        SLCD_DR1_SLCD_DR1_Msk
#define  SLCD_DR1_SLCD_DR1_0                      (0x00000001U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_1                      (0x00000002U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_2                      (0x00000004U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_3                      (0x00000008U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_4                      (0x00000010U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_5                      (0x00000020U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_6                      (0x00000040U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_7                      (0x00000080U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_8                      (0x00000100U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_9                      (0x00000200U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_10                     (0x00000400U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_11                     (0x00000800U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_12                     (0x00001000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_13                     (0x00002000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_14                     (0x00004000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_15                     (0x00008000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_16                     (0x00010000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_17                     (0x00020000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_18                     (0x00040000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_19                     (0x00080000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_20                     (0x00100000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_21                     (0x00200000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_22                     (0x00400000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_23                     (0x00800000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_24                     (0x01000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_25                     (0x02000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_26                     (0x04000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_27                     (0x08000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_28                     (0x10000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_29                     (0x20000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_30                     (0x40000000U << SLCD_DR1_SLCD_DR1_Pos) 
#define  SLCD_DR1_SLCD_DR1_31                     (0x80000000U << SLCD_DR1_SLCD_DR1_Pos) 

/**
  * @brief SLCD_DR2 Register Bit Definition
  */
#define  SLCD_DR2_SLCD_DR2_Pos                    (0)
#define  SLCD_DR2_SLCD_DR2_Msk                    (0xFFFFFFFFU << SLCD_DR2_SLCD_DR2_Pos)            /*!<Low 32 bit display data corresponding to COM1*/
#define  SLCD_DR2_SLCD_DR2                        SLCD_DR2_SLCD_DR2_Msk
#define  SLCD_DR2_SLCD_DR2_0                      (0x00000001U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_1                      (0x00000002U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_2                      (0x00000004U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_3                      (0x00000008U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_4                      (0x00000010U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_5                      (0x00000020U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_6                      (0x00000040U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_7                      (0x00000080U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_8                      (0x00000100U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_9                      (0x00000200U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_10                     (0x00000400U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_11                     (0x00000800U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_12                     (0x00001000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_13                     (0x00002000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_14                     (0x00004000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_15                     (0x00008000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_16                     (0x00010000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_17                     (0x00020000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_18                     (0x00040000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_19                     (0x00080000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_20                     (0x00100000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_21                     (0x00200000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_22                     (0x00400000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_23                     (0x00800000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_24                     (0x01000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_25                     (0x02000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_26                     (0x04000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_27                     (0x08000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_28                     (0x10000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_29                     (0x20000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_30                     (0x40000000U << SLCD_DR2_SLCD_DR2_Pos) 
#define  SLCD_DR2_SLCD_DR2_31                     (0x80000000U << SLCD_DR2_SLCD_DR2_Pos) 

/**
  * @brief SLCD_DR3 Register Bit Definition
  */
#define  SLCD_DR3_SLCD_DR3_Pos                    (0)
#define  SLCD_DR3_SLCD_DR3_Msk                    (0xFFFFFFFFU << SLCD_DR3_SLCD_DR3_Pos)            /*!<High 32 bit display data corresponding to COM1*/
#define  SLCD_DR3_SLCD_DR3                        SLCD_DR3_SLCD_DR3_Msk
#define  SLCD_DR3_SLCD_DR3_0                      (0x00000001U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_1                      (0x00000002U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_2                      (0x00000004U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_3                      (0x00000008U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_4                      (0x00000010U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_5                      (0x00000020U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_6                      (0x00000040U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_7                      (0x00000080U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_8                      (0x00000100U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_9                      (0x00000200U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_10                     (0x00000400U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_11                     (0x00000800U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_12                     (0x00001000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_13                     (0x00002000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_14                     (0x00004000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_15                     (0x00008000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_16                     (0x00010000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_17                     (0x00020000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_18                     (0x00040000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_19                     (0x00080000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_20                     (0x00100000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_21                     (0x00200000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_22                     (0x00400000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_23                     (0x00800000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_24                     (0x01000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_25                     (0x02000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_26                     (0x04000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_27                     (0x08000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_28                     (0x10000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_29                     (0x20000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_30                     (0x40000000U << SLCD_DR3_SLCD_DR3_Pos) 
#define  SLCD_DR3_SLCD_DR3_31                     (0x80000000U << SLCD_DR3_SLCD_DR3_Pos) 

/**
  * @brief SLCD_DR4 Register Bit Definition
  */
#define  SLCD_DR4_SLCD_DR4_Pos                    (0)
#define  SLCD_DR4_SLCD_DR4_Msk                    (0xFFFFFFFFU << SLCD_DR4_SLCD_DR4_Pos)            /*!<Low 32 bit display data corresponding to COM2*/
#define  SLCD_DR4_SLCD_DR4                        SLCD_DR4_SLCD_DR4_Msk
#define  SLCD_DR4_SLCD_DR4_0                      (0x00000001U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_1                      (0x00000002U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_2                      (0x00000004U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_3                      (0x00000008U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_4                      (0x00000010U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_5                      (0x00000020U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_6                      (0x00000040U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_7                      (0x00000080U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_8                      (0x00000100U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_9                      (0x00000200U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_10                     (0x00000400U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_11                     (0x00000800U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_12                     (0x00001000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_13                     (0x00002000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_14                     (0x00004000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_15                     (0x00008000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_16                     (0x00010000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_17                     (0x00020000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_18                     (0x00040000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_19                     (0x00080000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_20                     (0x00100000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_21                     (0x00200000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_22                     (0x00400000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_23                     (0x00800000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_24                     (0x01000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_25                     (0x02000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_26                     (0x04000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_27                     (0x08000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_28                     (0x10000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_29                     (0x20000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_30                     (0x40000000U << SLCD_DR4_SLCD_DR4_Pos) 
#define  SLCD_DR4_SLCD_DR4_31                     (0x80000000U << SLCD_DR4_SLCD_DR4_Pos) 

/**
  * @brief SLCD_DR5 Register Bit Definition
  */
#define  SLCD_DR5_SLCD_DR5_Pos                    (0)
#define  SLCD_DR5_SLCD_DR5_Msk                    (0xFFFFFFFFU << SLCD_DR5_SLCD_DR5_Pos)            /*!<High 32 bit display data corresponding to COM2*/
#define  SLCD_DR5_SLCD_DR5                        SLCD_DR5_SLCD_DR5_Msk
#define  SLCD_DR5_SLCD_DR5_0                      (0x00000001U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_1                      (0x00000002U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_2                      (0x00000004U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_3                      (0x00000008U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_4                      (0x00000010U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_5                      (0x00000020U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_6                      (0x00000040U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_7                      (0x00000080U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_8                      (0x00000100U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_9                      (0x00000200U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_10                     (0x00000400U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_11                     (0x00000800U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_12                     (0x00001000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_13                     (0x00002000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_14                     (0x00004000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_15                     (0x00008000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_16                     (0x00010000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_17                     (0x00020000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_18                     (0x00040000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_19                     (0x00080000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_20                     (0x00100000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_21                     (0x00200000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_22                     (0x00400000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_23                     (0x00800000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_24                     (0x01000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_25                     (0x02000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_26                     (0x04000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_27                     (0x08000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_28                     (0x10000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_29                     (0x20000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_30                     (0x40000000U << SLCD_DR5_SLCD_DR5_Pos) 
#define  SLCD_DR5_SLCD_DR5_31                     (0x80000000U << SLCD_DR5_SLCD_DR5_Pos) 

