SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_slcd.h
/**
  * @brief SLCD_DR6 Register Bit Definition
  */
#define  SLCD_DR6_SLCD_DR6_Pos                    (0)
#define  SLCD_DR6_SLCD_DR6_Msk                    (0xFFFFFFFFU << SLCD_DR6_SLCD_DR6_Pos)            /*!<Low 32 bit display data corresponding to COM3*/
#define  SLCD_DR6_SLCD_DR6                        SLCD_DR6_SLCD_DR6_Msk
#define  SLCD_DR6_SLCD_DR6_0                      (0x00000001U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_1                      (0x00000002U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_2                      (0x00000004U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_3                      (0x00000008U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_4                      (0x00000010U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_5                      (0x00000020U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_6                      (0x00000040U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_7                      (0x00000080U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_8                      (0x00000100U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_9                      (0x00000200U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_10                     (0x00000400U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_11                     (0x00000800U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_12                     (0x00001000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_13                     (0x00002000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_14                     (0x00004000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_15                     (0x00008000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_16                     (0x00010000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_17                     (0x00020000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_18                     (0x00040000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_19                     (0x00080000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_20                     (0x00100000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_21                     (0x00200000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_22                     (0x00400000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_23                     (0x00800000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_24                     (0x01000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_25                     (0x02000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_26                     (0x04000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_27                     (0x08000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_28                     (0x10000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_29                     (0x20000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_30                     (0x40000000U << SLCD_DR6_SLCD_DR6_Pos) 
#define  SLCD_DR6_SLCD_DR6_31                     (0x80000000U << SLCD_DR6_SLCD_DR6_Pos) 

/**
  * @brief SLCD_DR7 Register Bit Definition
  */
#define  SLCD_DR7_SLCD_DR7_Pos                    (0)
#define  SLCD_DR7_SLCD_DR7_Msk                    (0xFFFFFFFFU << SLCD_DR7_SLCD_DR7_Pos)            /*!<High 32 bit display data corresponding to COM3*/
#define  SLCD_DR7_SLCD_DR7                        SLCD_DR7_SLCD_DR7_Msk
#define  SLCD_DR7_SLCD_DR7_0                      (0x00000001U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_1                      (0x00000002U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_2                      (0x00000004U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_3                      (0x00000008U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_4                      (0x00000010U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_5                      (0x00000020U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_6                      (0x00000040U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_7                      (0x00000080U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_8                      (0x00000100U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_9                      (0x00000200U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_10                     (0x00000400U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_11                     (0x00000800U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_12                     (0x00001000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_13                     (0x00002000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_14                     (0x00004000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_15                     (0x00008000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_16                     (0x00010000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_17                     (0x00020000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_18                     (0x00040000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_19                     (0x00080000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_20                     (0x00100000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_21                     (0x00200000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_22                     (0x00400000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_23                     (0x00800000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_24                     (0x01000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_25                     (0x02000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_26                     (0x04000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_27                     (0x08000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_28                     (0x10000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_29                     (0x20000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_30                     (0x40000000U << SLCD_DR7_SLCD_DR7_Pos) 
#define  SLCD_DR7_SLCD_DR7_31                     (0x80000000U << SLCD_DR7_SLCD_DR7_Pos) 

/**
  * @brief SLCD_DR8 Register Bit Definition
  */
#define  SLCD_DR8_SLCD_DR8_Pos                    (0)
#define  SLCD_DR8_SLCD_DR8_Msk                    (0xFFFFFFFFU << SLCD_DR8_SLCD_DR8_Pos)            /*!<Low 32 bit display data corresponding to COM4*/
#define  SLCD_DR8_SLCD_DR8                        SLCD_DR8_SLCD_DR8_Msk
#define  SLCD_DR8_SLCD_DR8_0                      (0x00000001U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_1                      (0x00000002U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_2                      (0x00000004U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_3                      (0x00000008U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_4                      (0x00000010U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_5                      (0x00000020U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_6                      (0x00000040U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_7                      (0x00000080U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_8                      (0x00000100U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_9                      (0x00000200U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_10                     (0x00000400U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_11                     (0x00000800U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_12                     (0x00001000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_13                     (0x00002000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_14                     (0x00004000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_15                     (0x00008000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_16                     (0x00010000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_17                     (0x00020000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_18                     (0x00040000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_19                     (0x00080000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_20                     (0x00100000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_21                     (0x00200000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_22                     (0x00400000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_23                     (0x00800000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_24                     (0x01000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_25                     (0x02000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_26                     (0x04000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_27                     (0x08000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_28                     (0x10000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_29                     (0x20000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_30                     (0x40000000U << SLCD_DR8_SLCD_DR8_Pos) 
#define  SLCD_DR8_SLCD_DR8_31                     (0x80000000U << SLCD_DR8_SLCD_DR8_Pos) 

/**
  * @brief SLCD_DR9 Register Bit Definition
  */
#define  SLCD_DR9_SLCD_DR9_Pos                    (0)
#define  SLCD_DR9_SLCD_DR9_Msk                    (0xFFFFFFFFU << SLCD_DR9_SLCD_DR9_Pos)            /*!<High 32 bit display data corresponding to COM4*/
#define  SLCD_DR9_SLCD_DR9                        SLCD_DR9_SLCD_DR9_Msk
#define  SLCD_DR9_SLCD_DR9_0                      (0x00000001U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_1                      (0x00000002U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_2                      (0x00000004U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_3                      (0x00000008U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_4                      (0x00000010U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_5                      (0x00000020U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_6                      (0x00000040U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_7                      (0x00000080U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_8                      (0x00000100U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_9                      (0x00000200U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_10                     (0x00000400U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_11                     (0x00000800U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_12                     (0x00001000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_13                     (0x00002000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_14                     (0x00004000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_15                     (0x00008000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_16                     (0x00010000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_17                     (0x00020000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_18                     (0x00040000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_19                     (0x00080000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_20                     (0x00100000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_21                     (0x00200000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_22                     (0x00400000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_23                     (0x00800000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_24                     (0x01000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_25                     (0x02000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_26                     (0x04000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_27                     (0x08000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_28                     (0x10000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_29                     (0x20000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_30                     (0x40000000U << SLCD_DR9_SLCD_DR9_Pos) 
#define  SLCD_DR9_SLCD_DR9_31                     (0x80000000U << SLCD_DR9_SLCD_DR9_Pos) 

/**
  * @brief SLCD_DR10 Register Bit Definition
  */
#define  SLCD_DR10_SLCD_DR10_Pos                  (0)
#define  SLCD_DR10_SLCD_DR10_Msk                  (0xFFFFFFFFU << SLCD_DR10_SLCD_DR10_Pos)          /*!<Low 32 bit display data corresponding to COM5*/
#define  SLCD_DR10_SLCD_DR10                      SLCD_DR10_SLCD_DR10_Msk
#define  SLCD_DR10_SLCD_DR10_0                    (0x00000001U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_1                    (0x00000002U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_2                    (0x00000004U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_3                    (0x00000008U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_4                    (0x00000010U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_5                    (0x00000020U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_6                    (0x00000040U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_7                    (0x00000080U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_8                    (0x00000100U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_9                    (0x00000200U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_10                   (0x00000400U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_11                   (0x00000800U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_12                   (0x00001000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_13                   (0x00002000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_14                   (0x00004000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_15                   (0x00008000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_16                   (0x00010000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_17                   (0x00020000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_18                   (0x00040000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_19                   (0x00080000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_20                   (0x00100000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_21                   (0x00200000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_22                   (0x00400000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_23                   (0x00800000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_24                   (0x01000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_25                   (0x02000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_26                   (0x04000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_27                   (0x08000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_28                   (0x10000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_29                   (0x20000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_30                   (0x40000000U << SLCD_DR10_SLCD_DR10_Pos) 
#define  SLCD_DR10_SLCD_DR10_31                   (0x80000000U << SLCD_DR10_SLCD_DR10_Pos) 

/**
  * @brief SLCD_DR11 Register Bit Definition
  */
#define  SLCD_DR11_SLCD_DR11_Pos                  (0)
#define  SLCD_DR11_SLCD_DR11_Msk                  (0xFFFFFFFFU << SLCD_DR11_SLCD_DR11_Pos)          /*!<High 32 bit display data corresponding to COM5*/
#define  SLCD_DR11_SLCD_DR11                      SLCD_DR11_SLCD_DR11_Msk
#define  SLCD_DR11_SLCD_DR11_0                    (0x00000001U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_1                    (0x00000002U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_2                    (0x00000004U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_3                    (0x00000008U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_4                    (0x00000010U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_5                    (0x00000020U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_6                    (0x00000040U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_7                    (0x00000080U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_8                    (0x00000100U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_9                    (0x00000200U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_10                   (0x00000400U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_11                   (0x00000800U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_12                   (0x00001000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_13                   (0x00002000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_14                   (0x00004000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_15                   (0x00008000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_16                   (0x00010000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_17                   (0x00020000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_18                   (0x00040000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_19                   (0x00080000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_20                   (0x00100000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_21                   (0x00200000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_22                   (0x00400000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_23                   (0x00800000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_24                   (0x01000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_25                   (0x02000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_26                   (0x04000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_27                   (0x08000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_28                   (0x10000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_29                   (0x20000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_30                   (0x40000000U << SLCD_DR11_SLCD_DR11_Pos) 
#define  SLCD_DR11_SLCD_DR11_31                   (0x80000000U << SLCD_DR11_SLCD_DR11_Pos) 

/**
  * @brief SLCD_DR12 Register Bit Definition
  */
#define  SLCD_DR12_SLCD_DR12_Pos                  (0)
#define  SLCD_DR12_SLCD_DR12_Msk                  (0xFFFFFFFFU << SLCD_DR12_SLCD_DR12_Pos)          /*!<Low 32 bit display data corresponding to COM6*/
#define  SLCD_DR12_SLCD_DR12                      SLCD_DR12_SLCD_DR12_Msk
#define  SLCD_DR12_SLCD_DR12_0                    (0x00000001U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_1                    (0x00000002U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_2                    (0x00000004U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_3                    (0x00000008U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_4                    (0x00000010U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_5                    (0x00000020U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_6                    (0x00000040U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_7                    (0x00000080U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_8                    (0x00000100U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_9                    (0x00000200U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_10                   (0x00000400U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_11                   (0x00000800U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_12                   (0x00001000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_13                   (0x00002000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_14                   (0x00004000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_15                   (0x00008000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_16                   (0x00010000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_17                   (0x00020000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_18                   (0x00040000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_19                   (0x00080000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_20                   (0x00100000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_21                   (0x00200000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_22                   (0x00400000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_23                   (0x00800000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_24                   (0x01000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_25                   (0x02000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_26                   (0x04000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_27                   (0x08000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_28                   (0x10000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_29                   (0x20000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_30                   (0x40000000U << SLCD_DR12_SLCD_DR12_Pos) 
#define  SLCD_DR12_SLCD_DR12_31                   (0x80000000U << SLCD_DR12_SLCD_DR12_Pos) 

