SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_slcd.h
/**
  * @brief SLCD_DR13 Register Bit Definition
  */
#define  SLCD_DR13_SLCD_DR13_Pos                  (0)
#define  SLCD_DR13_SLCD_DR13_Msk                  (0xFFFFFFFFU << SLCD_DR13_SLCD_DR13_Pos)          /*!<High 32 bit display data corresponding to COM6*/
#define  SLCD_DR13_SLCD_DR13                      SLCD_DR13_SLCD_DR13_Msk
#define  SLCD_DR13_SLCD_DR13_0                    (0x00000001U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_1                    (0x00000002U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_2                    (0x00000004U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_3                    (0x00000008U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_4                    (0x00000010U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_5                    (0x00000020U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_6                    (0x00000040U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_7                    (0x00000080U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_8                    (0x00000100U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_9                    (0x00000200U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_10                   (0x00000400U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_11                   (0x00000800U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_12                   (0x00001000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_13                   (0x00002000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_14                   (0x00004000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_15                   (0x00008000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_16                   (0x00010000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_17                   (0x00020000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_18                   (0x00040000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_19                   (0x00080000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_20                   (0x00100000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_21                   (0x00200000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_22                   (0x00400000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_23                   (0x00800000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_24                   (0x01000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_25                   (0x02000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_26                   (0x04000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_27                   (0x08000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_28                   (0x10000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_29                   (0x20000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_30                   (0x40000000U << SLCD_DR13_SLCD_DR13_Pos) 
#define  SLCD_DR13_SLCD_DR13_31                   (0x80000000U << SLCD_DR13_SLCD_DR13_Pos) 

/**
  * @brief SLCD_DR14 Register Bit Definition
  */
#define  SLCD_DR14_SLCD_DR14_Pos                  (0)
#define  SLCD_DR14_SLCD_DR14_Msk                  (0xFFFFFFFFU << SLCD_DR14_SLCD_DR14_Pos)          /*!<Low 32 bit display data corresponding to COM7*/
#define  SLCD_DR14_SLCD_DR14                      SLCD_DR14_SLCD_DR14_Msk
#define  SLCD_DR14_SLCD_DR14_0                    (0x00000001U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_1                    (0x00000002U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_2                    (0x00000004U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_3                    (0x00000008U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_4                    (0x00000010U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_5                    (0x00000020U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_6                    (0x00000040U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_7                    (0x00000080U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_8                    (0x00000100U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_9                    (0x00000200U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_10                   (0x00000400U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_11                   (0x00000800U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_12                   (0x00001000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_13                   (0x00002000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_14                   (0x00004000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_15                   (0x00008000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_16                   (0x00010000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_17                   (0x00020000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_18                   (0x00040000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_19                   (0x00080000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_20                   (0x00100000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_21                   (0x00200000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_22                   (0x00400000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_23                   (0x00800000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_24                   (0x01000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_25                   (0x02000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_26                   (0x04000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_27                   (0x08000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_28                   (0x10000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_29                   (0x20000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_30                   (0x40000000U << SLCD_DR14_SLCD_DR14_Pos) 
#define  SLCD_DR14_SLCD_DR14_31                   (0x80000000U << SLCD_DR14_SLCD_DR14_Pos) 

/**
  * @brief SLCD_DR15 Register Bit Definition
  */
#define  SLCD_DR15_SLCD_DR15_Pos                  (0)
#define  SLCD_DR15_SLCD_DR15_Msk                  (0xFFFFFFFFU << SLCD_DR15_SLCD_DR15_Pos)          /*!<High 32 bit display data corresponding to COM7*/
#define  SLCD_DR15_SLCD_DR15                      SLCD_DR15_SLCD_DR15_Msk
#define  SLCD_DR15_SLCD_DR15_0                    (0x00000001U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_1                    (0x00000002U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_2                    (0x00000004U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_3                    (0x00000008U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_4                    (0x00000010U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_5                    (0x00000020U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_6                    (0x00000040U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_7                    (0x00000080U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_8                    (0x00000100U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_9                    (0x00000200U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_10                   (0x00000400U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_11                   (0x00000800U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_12                   (0x00001000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_13                   (0x00002000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_14                   (0x00004000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_15                   (0x00008000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_16                   (0x00010000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_17                   (0x00020000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_18                   (0x00040000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_19                   (0x00080000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_20                   (0x00100000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_21                   (0x00200000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_22                   (0x00400000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_23                   (0x00800000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_24                   (0x01000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_25                   (0x02000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_26                   (0x04000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_27                   (0x08000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_28                   (0x10000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_29                   (0x20000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_30                   (0x40000000U << SLCD_DR15_SLCD_DR15_Pos) 
#define  SLCD_DR15_SLCD_DR15_31                   (0x80000000U << SLCD_DR15_SLCD_DR15_Pos) 

#endif

